test/cassettes/track_success.json

[
  {
    "request": {
      "body": "{\"seller_user_email\":\"seller@gmail.com\",\"$user_id\":\"666069\",\"$user_email\":\"buyer@gmail.com\",\"$type\":\"$transaction\",\"$transaction_id\":\"573040\",\"$seller_user_id\":\"23671\",\"$payment_method\":{\"$payment_type\":\"$credit_card\",\"$payment_gateway\":\"$braintree\",\"$card_last4\":\"4444\",\"$card_bin\":\"542486\"},\"$currency_code\":\"USD\",\"$api_key\":\"CREDENTIALS\",\"$amount\":15230000}",
      "headers": [],
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.siftscience.com/v204/events?abuse_types="
    },
    "response": {
      "body": "{ \"status\" : 0 , \"error_message\" : \"OK\" , \"time\" : 1476283394 , \"request\" : \"{\\\"seller_user_email\\\":\\\"seller@gmail.com\\\",\\\"$user_id\\\":\\\"666069\\\",\\\"$user_email\\\":\\\"buyer@gmail.com\\\",\\\"$type\\\":\\\"$transaction\\\",\\\"$transaction_id\\\":\\\"573040\\\",\\\"$seller_user_id\\\":\\\"23671\\\",\\\"$payment_method\\\":{\\\"$payment_type\\\":\\\"$credit_card\\\",\\\"$payment_gateway\\\":\\\"$braintree\\\",\\\"$card_last4\\\":\\\"4444\\\",\\\"$card_bin\\\":\\\"542486\\\"},\\\"$currency_code\\\":\\\"USD\\\",\\\"$api_key\\\":\\\"CREDENTIALS\\\":15230000}\"}\n",
      "headers": {
        "Content-Type": "application/json; charset=UTF-8",
        "Date": "Wed, 12 Oct 2016 14:43:14 GMT",
        "Server": "nginx",
        "Vary": "Accept-Encoding",
        "Content-Length": "497",
        "Connection": "keep-alive"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]